-- Представление для информации о заказе
CREATE VIEW View_Заказы AS
SELECT 
    z.[Номер заказа],
    z.[Дата оформления],
    z.[ФИО заказчика],
    z.[Адрес проживания],
    z.[Телефон],
    p.[ФИО] AS "Приёмщик",
    z.[Сумма заказа],
    z.[Срок изготовления],
    z.[Признак срочности],
    z.[Сумма доплаты за срочность],
    z.[Дата выполнения]
FROM Заказы AS z
JOIN Приёмщики AS p ON z.[Код приёмщика] = p.[Код приёмщика];
GO

-- Представление для оправ
CREATE VIEW View_Заказ_оправы AS
SELECT 
    zo.[Номер заказа],
    o.[Наименование],
    zo.[Количество],
    o.[Цена]
FROM Заказ_оправы AS zo
JOIN Оправы AS o ON zo.[Код оправы] = o.[Артикул оправы];
GO

-- Представление для линз
CREATE VIEW View_Заказ_линзы AS
SELECT 
    zl.[Номер заказа],
    l.[Наименование],
    zl.[Количество],
    l.[Цена]
FROM Заказ_линзы AS zl
JOIN Линзы AS l ON zl.[Код линзы] = l.[Артикул линзы];
GO

-- Представление для услуг
CREATE VIEW View_Заказ_услуги AS
SELECT 
    zu.[Номер заказа],
    u.[Наименование],
    zu.[Код работника],
    r.[ФИО] AS "Работник",
    u.[Цена]
FROM Заказ_услуги AS zu
JOIN Услуги AS u ON zu.[Код услуги] = u.[Код услуги]
LEFT JOIN Работники AS r ON zu.[Код работника] = r.[Табельный номер];
GO

SELECT * FROM View_Заказы WHERE [Номер заказа] = 10;
SELECT * FROM View_Заказ_оправы WHERE [Номер заказа] = 3;
SELECT * FROM View_Заказ_линзы WHERE [Номер заказа] = 8;
SELECT * FROM View_Заказ_услуги WHERE [Номер заказа] = 9;

